
Super Duper Config
-----------------
* Packages
   #+BEGIN_SRC emacs-lisp

       (require 'package)
       (add-to-list 'package-archives '("melpa" . "https://melpa.org/packages/") t)
       ;; Comment/uncomment this line to enable MELPA Stable if desired.  See `package-archive-priorities`
       ;; and `package-pinned-packages`. Most users will not need or want to do this.
       ;;(add-to-list 'package-archives '("melpa-stable" . "https://stable.melpa.org/packages/") t)
       (package-initialize)
       ;;(package-refresh-contents)

    ;; Download Evil
    (unless (package-installed-p 'evil)
    (package-install 'evil ))
    (package-install 'use-package)
    (package-install 'evil)
    (package-install 'evil-org)
    (package-install 'smartparens)
    (package-install 'evil-commentary)
    (package-install 'evil-collection)
    (package-install 'fzf)
    (package-install 'windresize)
    (package-install 'eval-in-repl)

   #+END_SRC

   #+RESULTS:
   : ‘all-the-icons’ is already installed

** Expand to full screen on startup
   #+BEGIN_SRC emacs-lisp
     ;; start the initial frame maximized
     ;; (add-to-list 'initial-frame-alist '(fullscreen . maximized))
   #+END_SRC

   #+RESULTS:
   : ((fullscreen . maximized))

** Exec Paths
   #+begin_src emacs-lisp
     ;; (add-to-list 'exec-path "/usr/local/bin")
     ;; (add-to-list 'exec-path "/home/k8s/.fzf/bin")
     ;; (add-to-list 'exec-path "/usr/bin")
      ;; (setq exec-path (append exec-path '("/home/k8s/.fzf/bin")))
      ;; (setenv "PATH" (concat (getenv "PATH") ":/home/k8s/.fzf/bin"))

   #+end_src

   #+RESULTS:
   : /home/k8s/.local/bin:/usr/local/sbin:/usr/local/bin:/usr/sbin:/usr/bin:/sbin:/bin:/usr/games:/usr/local/games:/snap/bin:/home/k8s/.fzf/bin

